[
  {
    "question": "The rock-cut architecture represents one of the most important sources of our knowledge of early Indian art and history. Discuss.",
    "paper": "GS-1",
    "year": 2020,
    "source": null
  },
  {
    "question": "What was the difference between Mahatma Gandhi and Rabindranath Tagore in their approach towards education and nationalism?",
    "paper": "GS-1",
    "year": 2023,
    "source": null
  },
  {
    "question": "Discuss the main objectives of Population Education and point out the measures to achieve them in India in detail.",
    "paper": "GS-1",
    "year": 2021,
    "source": null
  },
  {
    "question": "'Constitutionally guaranteed judicial independence is a prerequisite of democracy'. Comment.",
    "paper": "GS-2",
    "year": 2023,
    "source": null
  },
  {
    "question": "The role of NGOs in the developmental process has been under scrutiny. In the light of the statement, discuss the role of NGOs in the development process.",
    "paper": "GS-2",
    "year": 2022,
    "source": null
  },
  {
    "question": "'The long-sustained image of India as a leader of the oppressed and marginalised nations has disappeared on account of its new policy of acquiring a dominant position in the world'. Discuss.",
    "paper": "GS-2",
    "year": 2019,
    "source": null
  },
  {
    "question": "Do you agree that the Indian economy has experienced V-shaped recovery? Give reasons in support of your answer.",
    "paper": "GS-3",
    "year": 2021,
    "source": null
  },
  {
    "question": "What are the major challenges of Public Distribution System (PDS) in India? How can it be made effective and transparent?",
    "paper": "GS-3",
    "year": 2022,
    "source": null
  },
  {
    "question": "Discuss the types of organised crimes. Describe the linkages between terrorists and organised crime that exist at the national and transnational levels.",
    "paper": "GS-3",
    "year": 2023,
    "source": null
  },
  {
    "question": "What is the role of S-400 air defence system in strengthening India's defence mechanism?",
    "paper": "GS-3",
    "year": 2021,
    "source": null
  },
  {
    "question": "What do you understand by 'probity' in public life? What are the difficulties in practicing it in the present times? How can these difficulties be overcome?",
    "paper": "GS-4",
    "year": 2023,
    "source": null
  },
  {
    "question": "What is meant by emotional intelligence and how can it be developed in people? How does it help an individual in taking ethical decisions?",
    "paper": "GS-4",
    "year": 2022,
    "source": null
  },
  {
    "question": "What are the main factors responsible for gender inequality in India? Discuss the contribution of Savitribai Phule in this regard.",
    "paper": "GS-1",
    "year": 2023,
    "source": null
  },
  {
    "question": "To what extent is the Central Administrative Tribunal (CAT) a substitute for High Courts? Explain.",
    "paper": "GS-2",
    "year": 2018,
    "source": null
  },
  {
    "question": "What are the key features of the National Clean Air Programme (NCAP)?",
    "paper": "GS-3",
    "year": 2020,
    "source": null
  }
]